docs/misc/enc/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-08 pią 13:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using luks/cryptsetup and loopdevices to create encrypted containers</title>
<meta name="author" content="Krzysztof Piecuch" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Using luks/cryptsetup and loopdevices to create encrypted containers</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge0d725e">1. Creating the container</a></li>
<li><a href="#org3c5bf0d">2. Mounting the container for work</a></li>
<li><a href="#orgb78c0e4">3. Unmounting the partition after work.</a></li>
<li><a href="#orgcb3e4e0">4. Removing the container</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge0d725e" class="outline-2">
<h2 id="orge0d725e"><span class="section-number-2">1.</span> Creating the container</h2>
<div class="outline-text-2" id="text-1">
<p>
We need to create a file, encrypt it and format. I use <code>fallocate</code> because it may be faster than <code>dd</code>, as it uses a special syscall.
</p>
<div class="org-src-container">
<pre class="src src-bash" id="orgea77105"><span style="color: #8ac6f2; font-weight: bold;">exec</span> 2&gt;&amp;1
<span style="color: #e5786d;">set</span> -x
fallocate -l 1G /tmp/container
<span style="color: #cae682;">dev</span>=$<span style="color: #8c8c8c;">(</span>sudo losetup --find --show /tmp/container<span style="color: #8c8c8c;">)</span>
head -c 5000 /dev/urandom &gt; /tmp/container-pwd
sudo cryptsetup luksFormat --type luks2 <span style="color: #95e454;">"$dev"</span> /tmp/container-pwd
sudo cryptsetup open --type luks2 <span style="color: #95e454;">"$dev"</span> container-luks --key-file /tmp/container-pwd
lsblk
sudo mkfs.ext4 /dev/mapper/container-luks
sudo cryptsetup close container-luks

:
</pre>
</div>

<pre class="example" id="org3b43763">
+ fallocate -l 1G /tmp/container
++ sudo losetup --find --show /tmp/container
+ dev=/dev/loop0
+ head -c 5000 /dev/urandom
+ sudo cryptsetup luksFormat --type luks2 /dev/loop0 /tmp/container-pwd
+ sudo cryptsetup open --type luks2 /dev/loop0 container-luks --key-file /tmp/container-pwd
+ lsblk
NAME             MAJ:MIN RM  SIZE RO TYPE  MOUNTPOINTS
loop0              7:0    0    1G  0 loop
└─container-luks 254:0    0 1008M  0 crypt
zd0              230:0    0   20G  0 disk  /var/lib/docker
nvme0n1          259:0    0  1.8T  0 disk
├─nvme0n1p1      259:1    0  512M  0 part  /efi
├─nvme0n1p2      259:2    0  512M  0 part  /boot
├─nvme0n1p3      259:3    0  700G  0 part
├─nvme0n1p4      259:4    0  200G  0 part
├─nvme0n1p5      259:5    0   16M  0 part
└─nvme0n1p6      259:6    0  195G  0 part
nvme1n1          259:7    0  1.8T  0 disk
├─nvme1n1p1      259:8    0  512M  0 part
├─nvme1n1p2      259:9    0  512M  0 part
└─nvme1n1p3      259:10   0  700G  0 part
+ sudo mkfs.ext4 /dev/mapper/container-luks
mke2fs 1.46.5 (30-Dec-2021)
Creating filesystem with 258048 4k blocks and 64512 inodes
Filesystem UUID: 0ed2c690-97e4-46ed-8c1a-bf8db5667400
Superblock backups stored on blocks:
	32768, 98304, 163840, 229376

Allocating group tables: 0/8   done
Writing inode tables: 0/8   done
Creating journal (4096 blocks): done
Writing superblocks and filesystem accounting information: 0/8   done

+ sudo cryptsetup close container-luks
+ :
</pre>
<p>
Now, <code>/tmp/container</code> is an encrypted file which (after decryption) is formatted with ext4.
</p>
</div>
</div>

<div id="outline-container-org3c5bf0d" class="outline-2">
<h2 id="org3c5bf0d"><span class="section-number-2">2.</span> Mounting the container for work</h2>
<div class="outline-text-2" id="text-2">
<p>
We can't mount an ordinary file - we need to create a /dev entry for it. losetup handles that by creating virtual devices. Then we decrypt the file with cryptsetup and mount an ext4 partition
</p>
<div class="org-src-container">
<pre class="src src-bash" id="org2ee43b2"><span style="color: #8ac6f2; font-weight: bold;">exec</span> 2&gt;&amp;1
<span style="color: #e5786d;">set</span> -x
<span style="color: #cae682;">dev</span>=$<span style="color: #8c8c8c;">(</span>sudo losetup --find --show /tmp/container<span style="color: #8c8c8c;">)</span>
sudo cryptsetup open --type luks2 <span style="color: #95e454;">"$dev"</span> container-luks --key-file /tmp/container-pwd
sudo mount /dev/mapper/container-luks /mnt
:
</pre>
</div>

<pre class="example" id="org96342aa">
++ sudo losetup --find --show /tmp/container
+ dev=/dev/loop1
+ sudo cryptsetup open --type luks2 /dev/loop1 container-luks --key-file /tmp/container-pwd
+ sudo mount /dev/mapper/container-luks /mnt
+ :
</pre>
</div>
</div>

<div id="outline-container-orgb78c0e4" class="outline-2">
<h2 id="orgb78c0e4"><span class="section-number-2">3.</span> Unmounting the partition after work.</h2>
<div class="outline-text-2" id="text-3">
<p>
Linux will handle that on shutdown but you can do it manually. Crafting <code>jq</code> invocation took most of the time.
</p>
<div class="org-src-container">
<pre class="src src-bash" id="org1076a96"><span style="color: #8ac6f2; font-weight: bold;">exec</span> 2&gt;&amp;1
<span style="color: #e5786d;">set</span> -x
sudo umount /mnt
sudo cryptsetup close container-luks
<span style="color: #cae682;">dev</span>=$<span style="color: #8c8c8c;">(</span>losetup -l -J | jq --raw-output <span style="color: #95e454;">'.loopdevices | map(select(."back-file" == "/tmp/container"))[0] | .name'</span><span style="color: #8c8c8c;">)</span>
sudo losetup -d <span style="color: #95e454;">"$dev"</span>
:
</pre>
</div>

<pre class="example" id="org4b2816e">
+ sudo umount /mnt
+ sudo cryptsetup close container-luks
++ losetup -l -J
++ jq --raw-output '.loopdevices | map(select(."back-file" == "/tmp/container"))[0] | .name'
+ dev=/dev/loop1
+ sudo losetup -d /dev/loop1
+ :
</pre>
</div>
</div>

<div id="outline-container-orgcb3e4e0" class="outline-2">
<h2 id="orgcb3e4e0"><span class="section-number-2">4.</span> Removing the container</h2>
<div class="outline-text-2" id="text-4">
<p>
That's as easy as removing the files.
</p>

<div class="org-src-container">
<pre class="src src-bash" id="org1a2dc28"><span style="color: #8ac6f2; font-weight: bold;">exec</span> 2&gt;&amp;1
<span style="color: #e5786d;">set</span> -x
<span style="color: #99968b;"># </span><span style="color: #99968b;">find the loopdev which mapped container</span>
rm /tmp/container /tmp/container-pwd
:
</pre>
</div>

<pre class="example" id="org71f808f">
+ rm /tmp/container /tmp/container-pwd
+ :
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Krzysztof Piecuch</p>
<p class="date">Created: 2022-04-08 pią 13:45</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
